---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireTypeSet.Clear
source: html/6e3b66b0-7611-f636-6819-b6b10f9a5d00.htm
---
# Autodesk.Revit.DB.Electrical.WireTypeSet.Clear Method

Removes every wire type from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```